MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526TBCDND/mcu.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 8;
			unsigned long LIMIT : 1;
			unsigned long IBIRQC : 1;
			unsigned long IBIPL : 1;
			unsigned long OFLC : 1;
			unsigned long  : 2;
			unsigned long ROLE : 2;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long ROLE : 2;
			unsigned long  : 2;
			unsigned long OFLC : 1;
			unsigned long IBIPL : 1;
			unsigned long IBIRQC : 1;
			unsigned long LIMIT : 1;
			unsigned long  : 8;
#endif
	} BIT;
	} ICTDCTR3;
	char           wk24[64];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DCR : 8;
			unsigned long LIMIT : 1;
			unsigned long IBIRQC : 1;
			unsigned long IBIPL : 1;
			unsigned long OFLC : 1;
			unsigned long  : 2;
			unsigned long ROLE : 2;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long ROLE : 2;
			unsigned long  : 2;
			unsigned long OFLC : 1;
			unsigned long IBIPL : 1;
			unsigned long IBIRQC : 1;
			unsigned long LIMIT : 1;
			unsigned long DCR : 8;
#endif
	} BIT;
	} ICDCTR;
	unsigned long  ICPIDLR;
	unsigned long  ICPIDHR;
	char           wk25[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long TADR : 10;
			unsigned long  : 4;
			unsigned long SAV : 1;
			unsigned long DAV : 1;
#else
			unsigned long DAV : 1;
			unsigned long SAV : 1;
			unsigned long  : 4;
			unsigned long TADR : 10;
			unsigned long  : 16;
#endif
	} BIT;
	} ICDAMR0;
	char           wk26[28];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ENINT : 1;
			unsigned long ENCR : 1;
			unsigned long  : 1;
			unsigned long ENHJ : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long ENHJ : 1;
			unsigned long  : 1;
			unsigned long ENCR : 1;
			unsigned long ENINT : 1;
#endif
	} BIT;
	} ICTEVR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ENTAS0 : 1;
			unsigned long ENTAS1 : 1;
			unsigned long ENTAS2 : 1;
			unsigned long ENTAS3 : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long ENTAS3 : 1;
			unsigned long ENTAS2 : 1;
			unsigned long ENTAS1 : 1;
			unsigned long ENTAS0 : 1;
#endif
	} BIT;
	} ICASR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MWL : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long MWL : 16;
#endif
	} BIT;
	} ICMWLR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MRL : 16;
			unsigned long IBIPL : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long IBIPL : 8;
			unsigned long MRL : 16;
#endif
	} BIT;
	} ICMRLR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TM : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long TM : 8;
#endif
	} BIT;
	} ICTMR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PNDINT : 4;
			unsigned long  : 1;
			unsigned long PERR : 1;
			unsigned long CAS : 2;
			unsigned long VRSV : 8;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long VRSV : 8;
			unsigned long CAS : 2;
			unsigned long PERR : 1;
			unsigned long  : 1;
			unsigned long PNDINT : 4;
#endif
	} BIT;
	} ICDSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MSWDR : 3;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long MSWDR : 3;
#endif
	} BIT;
	} ICMWSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MSRDR : 3;
			unsigned long TSCO : 3;
			unsigned long  : 26;
#else
			unsigned long  : 26;
			unsigned long TSCO : 3;
			unsigned long MSRDR : 3;
#endif
	} BIT;
	} ICMRSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MRTT : 24;
			unsigned long  : 7;
			unsigned long MRTTE : 1;
#else
			unsigned long MRTTE : 1;
			unsigned long  : 7;
			unsigned long MRTT : 24;
#endif
	} BIT;
	} ICMTTR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 8;
			unsigned long FREQ : 8;
			unsigned long INAC : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long INAC : 8;
			unsigned long FREQ : 8;
			unsigned long  : 8;
#endif
	} BIT;
	} ICTSIR;
	char           wk27[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BC : 5;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long BC : 5;
#endif
	} BIT;
	} ICBCR;
	char           wk28[16];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CQFL : 8;
			unsigned long RQFL : 8;
			unsigned long IQFL : 8;
			unsigned long ISC : 5;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long ISC : 5;
			unsigned long IQFL : 8;
			unsigned long RQFL : 8;
			unsigned long CQFL : 8;
#endif
	} BIT;
	} ICQBSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TBFL : 8;
			unsigned long RBFL : 8;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long RBFL : 8;
			unsigned long TBFL : 8;
#endif
	} BIT;
	} ICDBSR;
	char           wk29[36];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SQFL : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long SQFL : 8;
#endif
	} BIT;
	} ICSQSR;
	char           wk30[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SCLI : 1;
			unsigned long SDAI : 1;
			unsigned long SCLO : 1;
			unsigned long SDAO : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long SDAO : 1;
			unsigned long SCLO : 1;
			unsigned long SDAI : 1;
			unsigned long SCLI : 1;
#endif
	} BIT;
	} ICIMR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CE2C : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long CE2C : 8;
#endif
	} BIT;
	} ICCECR;
} st_ri3c_t;

typedef struct st_riic {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SDAI : 1;
			unsigned char SCLI : 1;
			unsigned char SDAO : 1;
			unsigned char SCLO : 1;
			unsigned char SOWP : 1;
			unsigned char CLO : 1;
			unsigned char IICRST : 1;
			unsigned char ICE : 1;
#else
			unsigned char ICE : 1;
			unsigned char IICRST : 1;
			unsigned char CLO : 1;
			unsigned char SOWP : 1;
			unsigned char SCLO : 1;
			unsigned char SDAO : 1;
			unsigned char SCLI : 1;
			unsigned char SDAI : 1;
#endif
	} BIT;
	} ICCR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 1;
			unsigned char ST : 1;
			unsigned char RS : 1;
			unsigned char SP : 1;
			unsigned char  : 1;
			unsigned char TRS : 1;
			unsigned char MST : 1;
			unsigned char BBSY : 1;
#else
			unsigned char BBSY : 1;
			unsigned char MST : 1;
			unsigned char TRS : 1;
			unsigned char  : 1;
			unsigned char SP : 1;
			unsigned char RS : 1;
			unsigned char ST : 1;
			unsigned char  : 1;
#endif
	} BIT;
	} ICCR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BC : 3;
			unsigned char BCWP : 1;
			unsigned char CKS : 3;
			unsigned char MTWP : 1;
#else
			unsigned char MTWP : 1;
			unsigned char CKS : 3;
			unsigned char BCWP : 1;
			unsigned char BC : 3;
#endif
	} BIT;
	} ICMR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TMOS : 1;
			unsigned char TMOL : 1;
			unsigned char TMOH : 1;
			unsigned char  : 1;
			unsigned char SDDL : 3;
			unsigned char DLCS : 1;
#else
			unsigned char DLCS : 1;
			unsigned char SDDL : 3;
			unsigned char  : 1;
			unsigned char TMOH : 1;
			unsigned char TMOL : 1;
			unsigned char TMOS : 1;
#endif
	} BIT;
	} ICMR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char NF : 2;
			unsigned char ACKBR : 1;
			unsigned char ACKBT : 1;
			unsigned char ACKWP : 1;
			unsigned char RDRFS : 1;
			unsigned char WAIT : 1;
			unsigned char SMBS : 1;
#else
			unsigned char SMBS : 1;
			unsigned char WAIT : 1;
			unsigned char RDRFS : 1;
			unsigned char ACKWP : 1;
			unsigned char ACKBT : 1;
			unsigned char ACKBR : 1;
			unsigned char NF : 2;
#endif
	} BIT;
	} ICMR3;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TMOE : 1;
			unsigned char MALE : 1;
			unsigned char NALE : 1;
			unsigned char SALE : 1;
			unsigned char NACKE : 1;
			unsigned char NFE : 1;
			unsigned char SCLE : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char SCLE : 1;
			unsigned char NFE : 1;
			unsigned char NACKE : 1;
			unsigned char SALE : 1;
			unsigned char NALE : 1;
			unsigned char MALE : 1;
			unsigned char TMOE : 1;
#endif
	} BIT;
	} ICFER;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SAR0E : 1;
			unsigned char SAR1E : 1;
			unsigned char SAR2E : 1;
			unsigned char GCAE : 1;
			unsigned char  : 1;
			unsigned char DIDE : 1;
			unsigned char  : 1;
			unsigned char HOAE : 1;
#else
			unsigned char HOAE : 1;
			unsigned char  : 1;
			unsigned char DIDE : 1;
			unsigned char  : 1;
			unsigned char GCAE : 1;
			unsigned char SAR2E : 1;
			unsigned char SAR1E : 1;
			unsigned char SAR0E : 1;
#endif
	} BIT;
	} ICSER;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TMOIE : 1;
			unsigned char ALIE : 1;
			unsigned char STIE : 1;
			unsigned char SPIE : 1;
			unsigned char NAKIE : 1;
			unsigned char RIE : 1;
			unsigned char TEIE : 1;
			unsigned char TIE : 1;
#else
			unsigned char TIE : 1;
			unsigned char TEIE : 1;
			unsigned char RIE : 1;
			unsigned char NAKIE : 1;
			unsigned char SPIE : 1;
			unsigned char STIE : 1;
			unsigned char ALIE : 1;
			unsigned char TMOIE : 1;
#endif
	} BIT;
	} ICIER;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char AAS0 : 1;
			unsigned char AAS1 : 1;
			unsigned char AAS2 : 1;
			unsigned char GCA : 1;
			unsigned char  : 1;
			unsigned char DID : 1;
			unsigned char  : 1;
			unsigned char HOA : 1;
#else
			unsigned char HOA : 1;
			unsigned char  : 1;
			unsigned char DID : 1;
			unsigned char  : 1;
			unsigned char GCA : 1;
			unsigned char AAS2 : 1;
			unsigned char AAS1 : 1;
			unsigned char AAS0 : 1;
#endif
	} BIT;
	} ICSR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TMOF : 1;
			unsigned char AL : 1;
			unsigned char START : 1;
			unsigned char STOP : 1;
			unsigned char NACKF : 1;
			unsigned char RDRF : 1;
			unsigned char TEND : 1;
			unsigned char TDRE : 1;
#else
			unsigned char TDRE : 1;
			unsigned char TEND : 1;
			unsigned char RDRF : 1;
			unsigned char NACKF : 1;
			unsigned char STOP : 1;
			unsigned char START : 1;
			unsigned char AL : 1;
			unsigned char TMOF : 1;
#endif
	} BIT;
	} ICSR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SVA0 : 1;
			unsigned char SVA : 7;
#else
			unsigned char SVA : 7;
			unsigned char SVA0 : 1;
#endif
	} BIT;
	} SARL0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FS : 1;
			unsigned char SVA : 2;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char SVA : 2;
			unsigned char FS : 1;
#endif
	} BIT;
	} SARU0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SVA0 : 1;
			unsigned char SVA : 7;
#else
			unsigned char SVA : 7;
			unsigned char SVA0 : 1;
#endif
	} BIT;
	} SARL1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FS : 1;
			unsigned char SVA : 2;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char SVA : 2;
			unsigned char FS : 1;
#endif
	} BIT;
	} SARU1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SVA0 : 1;
			unsigned char SVA : 7;
#else
			unsigned char SVA : 7;
			unsigned char SVA0 : 1;
#endif
	} BIT;
	} SARL2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FS : 1;
			unsigned char SVA : 2;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char SVA : 2;
			unsigned char FS : 1;
#endif
	} BIT;
	} SARU2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BRL : 5;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char BRL : 5;
#endif
	} BIT;
	} ICBRL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char BRH : 5;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char BRH : 5;
#endif
	} BIT;
	} ICBRH;
	unsigned char  ICDRT;
	unsigned char  ICDRR;
} st_riic_t;

